app/Controllers/Services.php

SELECT `is_active_os`
FROM `seo_menus`
WHERE `menu_name` = 'Services'
---
        $post_updates =  $this->user_slider->getUpdateLists('Service -');

        $is_active_os =  0;
        $active_os_data = $this->menu_model->select('is_active_os')->where('menu_name','Services')->find();