app/Controllers/Update.php

SELECT `is_active_os`
FROM `seo_menus`
WHERE `menu_name` = 'Updates'
---
        $post_updates =  $this->user_slider->getUpdateLists('Updates');

        $is_active_os =  0;
        $active_os_data = $this->menu_model->select('is_active_os')->where('menu_name','Updates')->find();