app/Models/Appearance_model.php

SELECT *
FROM `seo_header_footer`
---
    function findAllData(){
        $db      = \Config\Database::connect();
        $builder = $db->table('seo_header_footer');
        $res =  $builder->get();