app/Libraries/User_details.php

SELECT `id`, `menu_name`, `menu_link`, `is_active_os`, `default_menu`, `custom_default_menu`
FROM `seo_menus`
WHERE `sub_menu` = '0'
AND `footer_menu` = '0'
ORDER BY `sorting_order` ASC
SELECT `id`, `menu_link`, `service`
FROM `seo_service`
WHERE `menu_id` = '23'
AND `nav_view` = 1
SELECT `id`, `sub_menu`, `sub_menu_link`
FROM `seo_custom_sub_menu`
WHERE `menu_id` = '23'
ORDER BY `id` DESC
---
    public function menuLists(){

        //Get all menu list
        $this->menu = new MenuModel();
        $this->menu->select(['id', 'menu_name', 'menu_link','is_active_os','default_menu','custom_default_menu']);
        $this->menu->where(['sub_menu' => '0', 'footer_menu' => '0']);
        $this->menu->orderBy('sorting_order', 'asc');
        $menus =  $this->menu->findAll();

        //Make final menu array for view page
        $final_menu = [];
        foreach ($menus as $menu) {
            $sub = [];

            if ($menu['menu_name'] == "Services") {
                $this->services = new ServicesModel();
                $this->services->select(['id', 'menu_link', 'service']);
                $services = $this->services->where('menu_id', $menu['id']);
                $services = $this->services->where('nav_view', 1)->findAll();
                if (!empty($services)) {
                    foreach ($services as $service) {
                        $sub[] = [
                            'menu_name' => $service['service'], "menu_link" => 'services/' . $service['menu_link'],
                            "sub_menu" => $service['id']
                        ];
                    }
                }

                //Check custom menu exit or not
                $this->custom = new CustomSubMenu();
                $custom_submenus = $this->custom->select(['id', 'sub_menu', 'sub_menu_link'])
                    ->where('menu_id', $menu['id'])
                    ->orderBy('id', 'desc')
                    ->findAll();

SELECT `id`, `product_name`, `menu_link`
FROM `seo_products`
WHERE `menu_id` = '24'
AND `nav_view` = 1
---
                $this->product = new ProductsModel();
                $this->product->select(['id', 'product_name', 'menu_link']);
                $product = $this->product->where('menu_id', $menu['id']);
                $product = $this->product->where('nav_view', 1)->findAll();

SELECT `id`, `sub_menu`, `sub_menu_link`
FROM `seo_custom_sub_menu`
WHERE `menu_id` = '24'
ORDER BY `id` DESC
---

                //Check custom menu exit or not
                $this->custom = new CustomSubMenu();
                $custom_submenus = $this->custom->select(['id', 'sub_menu', 'sub_menu_link'])
                    ->where('menu_id', $menu['id'])
                    ->orderBy('id', 'desc')
                    ->findAll();

SELECT `id`, `title`, `slug`
FROM `seo_posts`
WHERE `created_by` = '1'
AND `status` = 'published'
ORDER BY `id` DESC
 LIMIT 5
---
                $user = $this->getUserDetails();
                $this->post = new PostsModel();
                $this->post->select(['id', 'title', 'slug']);
                $posts = $this->post
                    ->where(['created_by' => $user['id'], 'status' => 'published'])
                    ->orderBy('id', 'desc')
                    ->findAll(5);

SELECT `id`, `sub_menu`, `sub_menu_link`
FROM `seo_custom_sub_menu`
WHERE `menu_id` = '5'
ORDER BY `id` DESC
---

                //Check custom menu exit or not
                $this->custom = new CustomSubMenu();
                $custom_submenus = $this->custom->select(['id', 'sub_menu', 'sub_menu_link'])
                    ->where('menu_id', $menu['id'])
                    ->orderBy('id', 'desc')
                    ->findAll();

SELECT `id`, `sub_menu`, `sub_menu_link`
FROM `seo_custom_sub_menu`
WHERE `created_by` = '1'
AND `menu_id` = '1'
ORDER BY `id` DESC
---
                //Check custom menu exit or not
                $user = $this->getUserDetails();
                $this->custom = new CustomSubMenu();
                $custom_submenus = $this->custom->select(['id', 'sub_menu', 'sub_menu_link'])
                    ->where([
                        'created_by' => $user['id'],
                        'menu_id' => $menu['id']
                    ])
                    ->orderBy('id', 'desc')
                    ->findAll();

SELECT *
FROM `seo_custom_section`
WHERE `status` = 1
---
    public function getCustomSectionData($menu_id = 0, $sub_menu = 0, $data = null){

        $custom_section_model  = new CustomSectionModel();
        $custom_section = $custom_section_model->where('status', 1)->findAll();

SELECT *
FROM `seo_service`
WHERE `status` = '1'
---
    public function getServicesData(){
        $this->services = new ServicesModel();
        $services = $this->services->where('status', '1')->findAll();

SELECT *
FROM `seo_products`
---
    public function getAllProductsList(){
        $this->product = new ProductsModel();
        $all_products = $this->product->findAll();

SELECT `id`, `heading`, `videos`, `pages`
FROM `seo_video_section`
---
    public function getVideoLists($data = null){

        $this->video_link    = new VideoModel();
        $this->video_section = new VideoGallerySection();
        $video_sections = $this->video_section->select(['id','heading' ,'videos', 'pages'])->findAll();

SELECT *
FROM `seo_posts`
---
    public function getAllPostLists(){
        $this->posts = new PostsModel();
        $all_posts = $this->posts->findAll();

SELECT `id`, `page_id`, `slider`
FROM `seo_slider_section`
SELECT `title_font_family`, `desc_font_family`, `slider_image`, `title`, `description`, `text_color`, `heading_color`
FROM `seo_slider`
WHERE `seo_slider`.`id` = '5'
---
    public function getSlider($data = null){
        $this->slider_model  = new SliderSectionModel();
        $this->slider_images = new SliderModel();

        $this->slider_model->select(['id', 'page_id', 'slider']);
        $slider_details = $this->slider_model->findAll();
        $final_slider = [];
        if (!empty($slider_details)) {
            foreach ($slider_details as $slider_detail) {

                $slider_page = json_decode($slider_detail['page_id']);
                $slider = json_decode($slider_detail['slider']);

                $slider_image_list = [];
                foreach ($slider as $v) {

                    $this->slider_images->select(['title_font_family', 'desc_font_family', 'slider_image','blur_on_description', 'title_font_size', 'description_font_size', 'image_blur','content_position', 'title', 'description', 'text_color', 'heading_color']);
                    $image = $this->slider_images->find($v);

SELECT `seo_testimonial`.`name`, `seo_testimonial`.`image`, `seo_testimonial`.`description`, `seo_testimonial`.`created_at`, `seo_users`.`user_name`, `seo_users`.`business_logo`
FROM `seo_testimonial`
JOIN `seo_users` ON `seo_users`.`id`=`seo_testimonial`.`created_by`
WHERE `seo_testimonial`.`id` = '7'
---
    public function getTestimonialData($data = null){
        $this->testimonial    = new Testimonial();
        $this->test_section = new TestimonialSection();
        $test_sections = $this->test_section->select(['id', 'testimonials', 'pages_ids','heading'])->findAll();
        $final_testimonials = [];
        foreach($test_sections as $test_section){
            $testimonial = json_decode($test_section['testimonials']);
            $test_section_pages = json_decode($test_section['pages_ids']);
            $testimonial_lists = [];
            foreach ($testimonial as $v) {
                $this->testimonial->select('seo_testimonial.name, seo_testimonial.image, seo_testimonial.description, seo_testimonial.created_at,seo_users.user_name, seo_users.business_logo');

SELECT *
FROM `seo_posts`
WHERE `status` = 'published'
ORDER BY `id` DESC
---
    public function newPostUpdates($menu_id = 0, $sub_menu_id = 0){

        $this->posts = new PostsModel();
        $this->posts_section = new PostSectionModel();

        $this->posts_section->select(['id', 'post_id', 'pages_id','heading']);
        $posts_details = $this->posts_section->findAll();

        $final_posts = [];
        if (!empty($posts_details)) {
            foreach ($posts_details as $posts_detail) {

                $post_pages = json_decode($posts_detail['pages_id']);
                $posts      = json_decode($posts_detail['post_id']);
                $product_list = [];
                foreach ($posts as $v) {
                    $this->posts->select('*');
                    $update = $this->posts->where('status', 'published')->find($v);